content/imported/tutorials/flow-over-heated-plate-steady-state/fluid-openfoam/constant/thermophysicalProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      thermophysicalProperties;
}

dpdt            no;

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        molWeight       24.09989;
    }
    thermodynamics
    {
        Cp              5000;
        Hf              0;
    }
    transport
    {
        mu              0.0002;
        Pr              0.01;
    }
}
